# # ||||||||||||||| map ||||||||||||||||||||
a = [-1, 2, -3, 4, -500]
b = (map(abs, a))
# print(set(b))


s = ['sxs', 'SDSDS', 'Lsw234242d']
e = map(len, s)
# print(tuple(e))


# # ВОТ АНАЛОГ РЕШЕНИЯ ЭТОЙ ЗАДАЧИ, ТОЛЬКО ЧЕРЕЗ ГЕНЕРАТОР СПИСКОВ
a = [-1, 2, -3, 4, -500]
c = [abs(i) for i in a]


# print(c)

# ___________________________
def f(x):
    return x ** 2


q = [-1, 2, -3, 4, -500]
r = list(map(f, a))
# print(r)
# ___________________________

# # Вот так мы применяем встроенные методы: пишем тип, точка и метод без скобок
h = ['sxs', 'SDSDS', 'Lsd']
g = map(str.upper, h)
# print(tuple(g))
# ___________________________

# Фишки генераторов списков
a1 = [1, 21, 35, 4, 23]
b1 = [str(i) for i in a1]
c1 = [i[::-1] for i in b1]
print(c1)


# # Вот фишка для того, чтобы вводить много значений через пробел и не только
# s = input().split()
# print(s)


# s = list(map(int, input().split()))
# print(s)
