# ||||||||||||||| split и join ||||||||||||||||||||
# метод split разбивает строку на список со строками
s = 'Ivanov Ivan Ivanovich'
# print(s.split())  # в аргменте сплита указываем , по какому символу разделять

# метод join соединяет список со строками в строку
s1 = ['12121', 'wewe', 'dfdf', 'rererererer', '4r2efwqecqwfcqw', 'dfdsf']
# print(' - '.join(s1))  # ПРЕЖДЕ ЧЕМ ПОЛЬЗОВАТЬСЯ МЕТОДОМ JOIN НУЖНО ВСЕ ЭЛЕМЕНТЫ СПИСКА ПРИВЕСТИ В СТРОКУ!!!!!!!!!!!!!

# ____________________________________________________________
# s = input().split()  # так мы сразу получим список с элементами-строками
# print(s)
# ____________________________________________________________
# # А ВОТ МЫ СКЛЕИВАЕМ ЧИСЛА С ПОМОЩЬЮ ГЕНЕРАТОРА СПИСКОВ
s2 = [1, 2, 3, 4, 5, 6, 7, 89, 0, 8]
# print(int(''.join([str(i) for i in s2])))

a = [12121, 32323, 565656, 67676]
# print(int(''.join([str(i) for i in a])))

b = [12121, 32323, 565656, 67676]
# print('\n'.join([str(i) for i in b]))

a2 = 'sdfsdfgdhnjghkjmkhjbvgsfgs'
s_ = (a2.split('j'))
# print(s_)
# print('\n'.join(s_))

w = [42342, 23423, 345345]
# print('\n'.join([str(i) for i in w]))
