package main

/*
import _ package1 // при импорте пакетов пустой идентификатор применяют,
                  // чтобы не загрязнять пространство имён
          // никакие имена из пакета использоваться не будут
                  // пакет импортируется только ради выполнения его init()-функций

func Foo() (string, error){
}

func Bar() error {
}

func main() {
    Foo()         // можно игнорировать все возвращаемые значения
    s, _ := Foo() // часть игнорировать нельзя, поэтому здесь _ необходим

    ch := make(chan int)
    <-ch

    var x interface{} = 7
    i := x.(int)

    var Map = make(map[string]string)
    v := Map["key"]

    for k := range Map {    // цикл range может перечислять только ключи мапы или слайса

    }

    for _, v := range Map { // но не значения
     }                      // поэтому здесь _ необходим
}

*/
