package main

import "fmt"

func main() {
	// создастся слайс имеющий 100 дефолтных элементов и cap 100
	a := make([]int, 100)
	a = append(a, 555)
	fmt.Println(a)
	/*
	   [0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
	   0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
	   0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 555]
	*/

	// создастся пустой слайс имеющий capacity 100
	b := make([]int, 0, 100)
	b = append(b, 555)
	fmt.Println(b)
	// [555]
}
