package main

import "fmt"

func main() {
	dim := 100
	s := make([]int, 0, dim)
	fmt.Println(s) // []

	// заполняем слайс числами
	for i := 0; i < dim; i++ {
		s = append(s, i+1)
	}
	fmt.Println(s) /* [1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21
	22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44
	45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68
	69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92
	93 94 95 96 97 98 99 100]
	*/

	// оставляем первые и последние 10 элементов
	s = append(s[:10], s[dim-10:]...)
	println(s) // [20/100]0x140000ae000

	dim = len(s)
	half := s[:dim/2]
	fmt.Println(half) // [1 2 3 4 5 6 7 8 9 10]
	// разворачиваем слайс
	for i := range s[:dim/2] {
		s[i], s[dim-i-1] = s[dim-i-1], s[i]
	}
	fmt.Println(s) // [100 99 98 97 96 95 94 93 92 91 10 9 8 7 6 5 4 3 2 1]
}
