package main

import "fmt"

func main() {

	// Сделайте map для хранения прейскуранта в рублях
	PriceList := map[string]int{
		"хлеб":     50,
		"молоко":   100,
		"масло":    200,
		"колбаса":  500,
		"соль":     20,
		"огурцы":   200,
		"сыр":      600,
		"ветчина":  700,
		"буженина": 900,
		"помидоры": 250,
		"рыба":     300,
		"хамон":    150,
	}

	// Выведите перечень деликатесов — продуктов дороже 500 рублей.
	for k, v := range PriceList {
		switch {
		case v > 500:
			fmt.Println(k)
		}
	}

	/*
		Заказ выдан слайсом []string{"хлеб", "буженина", "сыр", "огурцы"}.
		Посчитайте стоимость заказа.
	*/
	order := []string{"хлеб", "буженина", "сыр", "огурцы"}
	sum := 0
	for i := range order {
		sum += PriceList[order[i]]
	}
	fmt.Println(sum)
}
