# ||||||||||||||| filter |||||||||||||||||||
# # передача собственной функции
def f(x):
    return 10 <= x <= 100


a = [1, 23, 4, 67, 4, 985, 0, 45, 2]
b = list(filter(f, a))
# print(b)

# ____________________________________________________
# # все это можно заменить генератором списков
c = [i for i in a if 10 <= i <= 100]
# print(c)

# ____________________________________________________
# # передача анонимной функции
d = ['qwe', 'sdfsdf', 'hg', 'oiiuli,']
e = list(filter(lambda x: len(x) > 4, d))
# print(e)

# ____________________________________________________
# # передача методов объектов
s = 'qr03eweg23423jty57678juu'
v = list(filter(str.isdigit, s))
# print(v)

# ____________________________________________________
# # фильтруем словарь с помощью анонимной функции
dct = {'dsfgsf': 123, 'qwe': 34534, 'mhklk': 87678, 'kjl,jj': 7867, 'hilhu': 125799593, '45fgd': 898}
k = list(filter(lambda x: dct[x] > 700, dct))
# print(k)
